uni/politikwissenschaft/Textanalyse/12/slapin_notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-28 Thu 12:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcc08814">1. A scaling Model for Estimating Time-Series Party Positions from Texts</a>
<ul>
<li><a href="#orge255739">1.1. Introduction</a></li>
<li><a href="#orgb4f6b4b">1.2. Current Methods for Estimating Party Positions</a>
<ul>
<li><a href="#org836aa91">1.2.1. Expert Surveys</a></li>
<li><a href="#orgc58daf5">1.2.2. Hand Coding: Comparative Manifestos Project</a></li>
<li><a href="#org5b02aa3">1.2.3. Computer-Based Content Analysis</a></li>
</ul>
</li>
<li><a href="#org9ec0fdc">1.3. A Scaling Approach to Party Positions</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgcc08814" class="outline-2">
<h2 id="orgcc08814"><span class="section-number-2">1</span> A scaling Model for Estimating Time-Series Party Positions from Texts</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge255739" class="outline-3">
<h3 id="orge255739"><span class="section-number-3">1.1</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Textanalyse mittels <i>Wordfish</i> zur Schätzung von deutschen Parteipositionen auf Rechts-Links Skala zw 1990 u 2005
<ul class="org-ul">
<li>Parteipositionen sind abstrakte Konzepte die nicht direkt beobachtbar/messbar sind
<ul class="org-ul">
<li>bislang Messversuche via Surveys, Handkodierung von Parteiprogrammen, computergestützte Kodierung von Parteiprogrammen</li>
</ul></li>
<li>Text will mit statistischen Modell, das auf existierenden Methoden aufbaut + erweitert, Beitrag leisten und Parteipositionen &amp; verbundene Unsicherheiten über die Zeit hinweg mittels Worthäufigkeiten in Parteiprogrammen untersuchen
<ul class="org-ul">
<li>Einführung eines neuen Modells und Vergleich mit Existierenden</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb4f6b4b" class="outline-3">
<h3 id="orgb4f6b4b"><span class="section-number-3">1.2</span> Current Methods for Estimating Party Positions</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Parteipositionen sind nicht beobachtbar &rarr; <i>latente Variable</i>
<ul class="org-ul">
<li>werden indirekt durch Aktivitäten preisgegeben, zB Parteiprogramme</li>
</ul></li>
<li>drei Parteiposition Analysemethoden</li>
</ul>
</div>
<div id="outline-container-org836aa91" class="outline-4">
<h4 id="org836aa91"><span class="section-number-4">1.2.1</span> Expert Surveys</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>in idealer Welt beste/genauste Methode</li>
<li>Experten können große Mengen aus verschiedensten Quellen analysieren</li>
<li>alllerdings teuer, aufwendig und eingeschränkte Vergleichbarkeit über Studien/Surveys hinweg</li>
</ul>
</div>
</div>
<div id="outline-container-orgc58daf5" class="outline-4">
<h4 id="orgc58daf5"><span class="section-number-4">1.2.2</span> Hand Coding: Comparative Manifestos Project</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>CMP Gruppe kodiert Parteiprogramme von Hand (umfangreiches Projekt)</li>
<li>Score für die Parteien ist der jeweilige Prozentsatz von vorhandenen (Quasi-)Sätzen die in eine von 56 Issue Kategorien fallen</li>
<li>um davon Links-Rechts Positionierung abzuleiten zB Spezifizierung von Issues die insbed. links/rechts relevant ist und somit Berechnung eines Links/Rechts Scores</li>
<li>the hand-coding approach provides the only cross- sectional time-series database on party positions to date</li>
</ul>
</div>
</div>
<div id="outline-container-org5b02aa3" class="outline-4">
<h4 id="org5b02aa3"><span class="section-number-4">1.2.3</span> Computer-Based Content Analysis</h4>
<div class="outline-text-4" id="text-1-2-3">
</div>
<ol class="org-ol">
<li><a id="orgfbd1bcc"></a>Laver, Benoit &amp; Garry: Verwendung von Referenztexten statt selbstkodierter Diktionäre<br />
<div class="outline-text-5" id="text-1-2-3-1">
<ul class="org-ul">
<li>zunächst Auswahl von Referenztexten die einem gewissen Extrem im pol Raum zugeordnet werden können (evtl auch für Mitte)</li>
<li>begleitet Zuweisung von Referenzwerten an die Referenztexte (idealerweise im Kontext bereit schon existierender Expertsurveys)</li>
<li>mittels Computerprogramm <i>Wordscores</i> zählen wie oft Worte aus Referenztexten in Quelltexten auftauchen und Vergleich (evtl falsch?) // "computer program Wordscores then counts the number of times each word occurs in the reference texts and compares these counts to word counts from the texts being analyzed"</li>
<li>Parteiprogramme werden auf ein Kontinuum zwischen den Referenztexten platziert, basierend darauf wie nah die Word Counts an Referenztexten sind</li>
</ul>

<p>
<i>Wordscores</i> Probleme:
</p>
<ul class="org-ul">
<li>Nützlichkeit kann durch das Finden von passenden Referenztexten und Referenzwerten gehindert werden
<ul class="org-ul">
<li>keine Einigkeit darüber was politische Extreme betrifft</li>
</ul></li>
<li><p>
Zuweisung selber Gewichtung der Worte im  Estimation process
</p>
<ul class="org-ul">
<li>somit verzerren häufig auftretende Worte ohne pol Gewicht (neutral) die Einschätzung des Dokuments in Richtung der Mitte</li>
</ul>
<ul class="org-ul">
<li>Probleme bei Analyse über längeren Zeitraum
<ul class="org-ul">
<li>pol Lexikon unter dauerhaftem Wandel</li>
<li>schwierig bei Auswahl von Referenztexten</li>
</ul></li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org9ec0fdc" class="outline-3">
<h3 id="org9ec0fdc"><span class="section-number-3">1.3</span> A Scaling Approach to Party Positions</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Annahme dass Vokabular in Parteiprogrammen Informationen über Position(en) im politischen Raum enthält</li>
<li>Vorteile:
<ul class="org-ul">
<li>bessere Einschätzungen über Zeiträume</li>
<li>benötigt keine Referenztexte, da Annahme einer statistischen Verteilung von Worthäufigkeiten</li>
<li>Benutzbarkeit und Evaluierung aller Worte</li>
</ul></li>
</ul>

<p>
Naive Bayes:
</p>
<ul class="org-ul">
<li>zur Analyse von Worten/Texten wird häufig die <i>naive Bayes</i> assumption benutzt:
<ul class="org-ul">
<li>ein Text wird als Vektor von Worten repräsentiert</li>
<li>Annahme, dass individuelle Worte zufallsverteilt sind
<ul class="org-ul">
<li>bzw: Wahrscheinlichkeit des Auftreten von Worten ist unabhängig von Positionen/Stellen anderer Worte in dem Text</li>
<li>zwar mehr oder weniger bewiesen, dass diese Annahme falsch ist; naive Bayes dennoch realistische Klassifikation</li>
</ul></li>
</ul></li>
</ul>

<p>
Poisson:
</p>
<ul class="org-ul">
<li>Gelehrte haben außerdem versucht eine stat. Verteilung zu finden, welche die Benutzung von Worten am akkuratesten beschreibt</li>
<li>übliche Verteilungen sind bspw Poisson, negative binominal, zero-inflated(binomial) Verteilungen und andere Poisson Mixtures</li>
<li>all diese Verteilungen seien stark verzerrt (ebenso ist die Nutzung von Worten)</li>
</ul>

<p>
Analyse von Worthäufigkeiten in Parteiprogrammen und Generierung der Häufigkeiten durch einen Poisson Prozess
</p>
<ul class="org-ul">
<li>Wahl dieser Verteilung da sie vergleichsweise simpel ist</li>
<li><p>
nur ein Parameter &lambda;
</p>
<ul class="org-ul">
<li>&lambda; ist hier beides, Mittelwert (arithm. Mittel) und Varianz</li>
</ul>
<ul class="org-ul">
<li>Häufigkeit der Verwendung des Wortes <i>j</i> von Partei <i>i</i> in Wahljahr <i>t</i> wird einer Poisson Verteilung entnommen</li>
<li>dieses spezifische Modell ist im Grunde genommen ein <i>Poisson naive Bayes model</i></li>
</ul></li>
</ul>

\begin{equation*}
\begin{aligned}
y_{ijt} \tildelow Poisson (\lambda_{ijt})\\
\lambda_{ijt} = \text{exp}(\alpha_{it} + \Psi_{j} + \beta_{j} * \omega_{it})
\end{aligned}
\end{equation*}

<ul class="org-ul">
<li>\(y_{ijt}\) ist  Anzahl des Wortes \(j\) in Partei \(i\)'s Programm zum Zeitpunkt \(t\)</li>
<li>\(\alpha\) is a set of party-election year fixed effects
<ul class="org-ul">
<li>um Möglichkeit das Parteien vllt in manchen Jahren viel mehr/viel längere Parteiprogramme verfasst haben als in anderen</li>
</ul></li>
<li>\(\Psi\) is a set of word fixed effects
<ul class="org-ul">
<li>um den Umstand das einige Worte von allen Parteien häufiger genutzt werden als andere Worte</li>
</ul></li>
<li>\(\beta\) is an estimate of a word specific weight capturing the importance of word \(j\) in discriminiating between party positions
<ul class="org-ul">
<li>erlaubt Rückschluss darauf, welche Worte sich unterscheien zwischen Parteipositionen</li>
</ul></li>
<li>\(\omega\) is the estimate of party \(i\)'s position in election year \(t\) (therefore it is indexing one specific manifesto)
<ul class="org-ul">
<li>Parteiposition in jedem Wahljahr</li>
</ul></li>

<li>Modell behandelt jedes Parteiprogramm als separate Parteiposition und alle Positionen werden zeitgleich/gleichzeitig geschätzt
F5 mitte absatz</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-06-28 Thu 12:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
