uni/Textanalyse/12/slapin_notes.tex
% Created 2018-06-26 Tue 00:23
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{textcomp}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.0.91 (Org mode 9.1.13)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{A scaling Model for Estimating Time-Series Party Positions from Texts}
\label{sec:org509b83b}
\subsection{Introduction}
\label{sec:orgaeffe85}
\begin{itemize}
\item Textanalyse mittels \emph{Wordfish} zur Schätzung von deutschen Parteipositionen auf Rechts-Links Skala zw 1990 u 2005
\begin{itemize}
\item Parteipositionen sind abstrakte Konzepte die nicht direkt beobachtbar/messbar sind
\begin{itemize}
\item bislang Messversuche via Surveys, Handkodierung von Parteiprogrammen, computergestützte Kodierung von Parteiprogrammen
\end{itemize}
\item Text will mit statistischen Modell, das auf existierenden Methoden aufbaut + erweitert, Beitrag leisten und Parteipositionen \& verbundene Unsicherheiten über die Zeit hinweg mittels Worthäufigkeiten in Parteiprogrammen untersuchen
\begin{itemize}
\item Einführung eines neuen Modells und Vergleich mit Existierenden
\end{itemize}
\end{itemize}
\end{itemize}
\subsection{Current Methods for Estimating Party Positions}
\label{sec:org3f5d15f}
\begin{itemize}
\item Parteipositionen sind nicht beobachtbar \(\rightarrow\) \emph{latente Variable}
\begin{itemize}
\item werden indirekt durch Aktivitäten preisgegeben, zB Parteiprogramme
\end{itemize}
\item drei Parteiposition Analysemethoden
\end{itemize}
\subsubsection{Expert Surveys}
\label{sec:org9d66161}
\begin{itemize}
\item in idealer Welt beste/genauste Methode
\item Experten können große Mengen aus verschiedensten Quellen analysieren
\item alllerdings teuer, aufwendig und eingeschränkte Vergleichbarkeit über Studien/Surveys hinweg
\end{itemize}
\subsubsection{Hand Coding: Comparative Manifestos Project}
\label{sec:org715072f}
\begin{itemize}
\item CMP Gruppe kodiert Parteiprogramme von Hand (umfangreiches Projekt)
\item Score für die Parteien ist der jeweilige Prozentsatz von vorhandenen (Quasi-)Sätzen die in eine von 56 Issue Kategorien fallen
\item um davon Links-Rechts Positionierung abzuleiten zB Spezifizierung von Issues die insbed. links/rechts relevant ist und somit Berechnung eines Links/Rechts Scores
\item the hand-coding approach provides the only cross- sectional time-series database on party positions to date
\end{itemize}
\subsubsection{Computer-Based Content Analysis}
\label{sec:orgd0f0d1a}
\begin{enumerate}
\item Laver, Benoit \& Garry: Verwendung von Referenztexten statt selbstkodierter Diktionäre
\label{sec:org6c35e06}
\begin{itemize}
\item zunächst Auswahl von Referenztexten die einem gewissen Extrem im pol Raum zugeordnet werden können (evtl auch für Mitte)
\item begleitet Zuweisung von Referenzwerten an die Referenztexte (idealerweise im Kontext bereit schon existierender Expertsurveys)
\item mittels Computerprogramm \emph{Wordscores} zählen wie oft Worte aus Referenztexten in Quelltexten auftauchen und Vergleich (evtl falsch?) // "computer program Wordscores then counts the number of times each word occurs in the reference texts and compares these counts to word counts from the texts being analyzed"
\item Parteiprogramme werden auf ein Kontinuum zwischen den Referenztexten platziert, basierend darauf wie nah die Word Counts an Referenztexten sind
\end{itemize}

\emph{Wordscores} Probleme:
\begin{itemize}
\item Nützlichkeit kann durch das Finden von passenden Referenztexten und Referenzwerten gehindert werden
\begin{itemize}
\item keine Einigkeit darüber was politische Extreme betrifft
\end{itemize}
\item Zuweisung selber Gewichtung der Worte im  Estimation process
\begin{itemize}
\item somit verzerren häufig auftretende Worte ohne pol Gewicht (neutral) die Einschätzung des Dokuments in Richtung der Mitte
\end{itemize}
\begin{itemize}
\item Probleme bei Analyse über längeren Zeitraum
\begin{itemize}
\item pol Lexikon unter dauerhaftem Wandel
\item schwierig bei Auswahl von Referenztexten
\end{itemize}
\end{itemize}
\end{itemize}
\end{enumerate}
\subsection{A Scaling Approach to Party Positions}
\label{sec:org9640c68}
\begin{itemize}
\item Annahme dass Vokabular in Parteiprogrammen Informationen über Position(en) im politischen Raum enthält
\item Vorteile:
\begin{itemize}
\item bessere Einschätzungen über Zeiträume
\item benötigt keine Referenztexte, da Annahme einer statistischen Verteilung von Worthäufigkeiten
\item Benutzbarkeit und Evaluierung aller Worte
\end{itemize}
\end{itemize}

Naive Bayes:
\begin{itemize}
\item zur Analyse von Worten/Texten wird häufig die \emph{naive Bayes} assumption benutzt:
\begin{itemize}
\item ein Text wird als Vektor von Worten repräsentiert
\item Annahme, dass individuelle Worte zufallsverteilt sind
\begin{itemize}
\item bzw: Wahrscheinlichkeit des Auftreten von Worten ist unabhängig von Positionen/Stellen anderer Worte in dem Text
\item zwar mehr oder weniger bewiesen, dass diese Annahme falsch ist; naive Bayes dennoch realistische Klassifikation
\end{itemize}
\end{itemize}
\end{itemize}

Poisson:
\begin{itemize}
\item Gelehrte haben außerdem versucht eine stat. Verteilung zu finden, welche die Benutzung von Worten am akkuratesten beschreibt
\item übliche Verteilungen sind bspw Poisson, negative binominal, zero-inflated(binomial) Verteilungen und andere Poisson Mixtures
\item all diese Verteilungen seien stark verzerrt (ebenso ist die Nutzung von Worten)
\end{itemize}

Analyse von Worthäufigkeiten in Parteiprogrammen und Generierung der Häufigkeiten durch einen Poisson Prozess
\begin{itemize}
\item Wahl dieser Verteilung da sie vergleichsweise simpel ist
\item nur ein Parameter \(\lambda\)
\begin{itemize}
\item \(\lambda\) ist hier beides, Mittelwert (arithm. Mittel) und Varianz
\end{itemize}
\begin{itemize}
\item Häufigkeit der Verwendung des Wortes \emph{j} von Partei \emph{i} in Wahljahr \emph{t} wird einer Poisson Verteilung entnommen
\item dieses spezifische Modell ist im Grunde genommen ein \emph{Poisson naive Bayes model}
\end{itemize}
\end{itemize}

\begin{equation*}
\begin{aligned}
y_{ijt} \tildelow Poisson (\lambda_{ijt})\\
\lambda_{ijt} = \text{exp}(\alpha_{it} + \Psi_{j} + \beta_{j} * \omega_{it})
\end{aligned}
\end{equation*}

\begin{itemize}
\item \(y_{ijt}\) ist  Anzahl des Wortes \(j\) in Partei \(i\)'s Programm zum Zeitpunkt \(t\)
\item \(\alpha\) is a set of party-election year fixed effects
\begin{itemize}
\item um Möglichkeit das Parteien vllt in manchen Jahren viel mehr/viel längere Parteiprogramme verfasst haben als in anderen
\end{itemize}
\item \(\Psi\) is a set of word fixed effects
\begin{itemize}
\item um den Umstand das einige Worte von allen Parteien häufiger genutzt werden als andere Worte
\end{itemize}
\item \(\beta\) is an estimate of a word specific weight capturing the importance of word \(j\) in discriminiating between party positions
\begin{itemize}
\item erlaubt Rückschluss darauf, welche Worte sich unterscheien zwischen Parteipositionen
\end{itemize}
\item \(\omega\) is the estimate of party \(i\)'s position in election year \(t\) (therefore it is indexing one specific manifesto)
\begin{itemize}
\item Parteiposition in jedem Wahljahr
\end{itemize}

\item Modell behandelt jedes Parteiprogramm als separate Parteiposition und alle Positionen werden zeitgleich/gleichzeitig geschätzt
F5 mitte absatz
\end{itemize}
\end{document}
